Autodesk.Revit.DB.ExternalResourceBrowserData.IsValidResouceName(System.String)
Checks whether the resource name is valid.
resourceName:
The resource name to check.
Returns:
True if the name is a valid resource name, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.ExternalResourceBrowserData.GetSubFolders
Gets the sub folders under the folder path of the browser data.
Returns:
The sub folders under folder path of the browser data.
Since:
2015

Autodesk.Revit.DB.ExternalResourceBrowserData.AddSubFolder(System.String)
Adds a sub folder to the folder path with the given name.
folderName:
The name of the folder.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The folderName is not a valid folder name used to display in Revit external resource browse UI.
The name should be a unique non-empty short name and it should not contain any invalid character of \\/:*?"<>|.
The length of combined path(server name + folder path) should not exceeds 259.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.ExternalResourceBrowserData.FolderPath
The current folder path to which the new resources and sub folder belong.
Since:
2015

Autodesk.Revit.DB.ExternalResourceBrowserData.#ctor(Autodesk.Revit.DB.Document,System.Guid,System.String,Autodesk.Revit.DB.ExternalResourceMatchOptions)
Constructs a new ExternalResourceBrowserData using the given document(optional), server id, folder path and match options.
document:
The document for which the external resource browser data is requested.
The document can be null, if so, the getCallingDocumentModelPath() will not return ModelPath.
serverId:
The id of IExternalResourceServer which handles the external resource browsing and loading.
folderPath:
The folder path to which the external resources and sub folders belong.
The folder separator should always be "/" and "/" always represents the root folder for the server.The interpretation of what a folder represents is up to the server.
For example, the folder "/English/Keynote" might be a physical folder on a disk, or a table or key in a database.
matchOptions:
The options to match the external resources and folders.
Generally, the returned resources should match the options, otherwise the resource may be regarded
as invalid which may not be available in browser dialogs.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.ExternalResourceBrowserData
Represents a collection of external resources and external resource folders to be presented as
the content of a folder in the file browser in Revit.
Remarks:
This data represents the contents to be shown to the user while they are browsing a specific folder in Revit.
The folder path can be obtained from the Autodesk.Revit.DB.ExternalResourceBrowserData.FolderPath property.
The external resource server is expected to populate all of the available resources and subfolders
that should appear in the Revit file browser while the browser is open to this particular folder.
If the user navigates to another folder, a different ExternalResourceBrowserData object will be
provided to allow the server to populate resources at that location.
When adding resource and sub folder, the resource and sub folder should not be added recursively.
When adding resource and sub folder, the name should be unique short name(without folder).
The name of resource and sub folder should not contain any invalid character of \/:*?"<>|.
The length of resource combined path(server name + folder path + resource name) should not exceed 259;
The length of sub folder also has same restriction.
Since:
2015